tylertms/dspic33e-sim/conformance/i2c.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} I2cConformance;

static const uint16_t bases[DSPIC33_I2C_COUNT] = {0x0200u, 0x0210u};
static const uint8_t slave_irqs[DSPIC33_I2C_COUNT] = {16u, 49u};
static const uint8_t master_irqs[DSPIC33_I2C_COUNT] = {17u, 50u};

static void expect(I2cConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[i2c-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~(uint16_t)(1u << (irq % 16u))));
}

static void enable_interrupt(Dspic33* cpu, uint8_t irq, uint8_t priority,
                             uint16_t vector) {
    uint16_t enable = (uint16_t)(0x0820u + (irq / 16u) * 2u);
    uint16_t mask = (uint16_t)(1u << (irq % 16u));
    uint16_t ipc = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(cpu, enable, (uint16_t)(dspic33_read_word(cpu, enable) | mask));
    dspic33_write_word(
        cpu, ipc,
        (uint16_t)((dspic33_read_word(cpu, ipc) & ~(uint16_t)(7u << shift)) |
                   (uint16_t)(priority << shift)));
    cpu->program[(0x0014u + irq * 2u) / 2u] = vector;
}

static uint16_t stored_word(const Dspic33* cpu, uint16_t address) {
    return (uint16_t)(cpu->data[address] |
                      ((uint16_t)cpu->data[(uint16_t)(address + 1u)] << 8u));
}

static uint64_t operation_cycles(uint16_t baud, uint8_t half_periods) {
    return ((uint64_t)(baud + 2u) * half_periods + 1u) / 2u;
}

static uint64_t control_cycles(uint16_t baud) { return operation_cycles(baud, 2u); }

static uint64_t byte_cycles(uint16_t baud) { return operation_cycles(baud, 18u); }

static uint64_t receive_cycles(uint16_t baud) { return operation_cycles(baud, 16u); }

static uint64_t condition_cycles(uint16_t baud) { return operation_cycles(baud, 3u); }

static void configure_dma_channel(Dspic33* cpu, uint8_t channel, uint8_t request,
                                  uint16_t start, uint16_t pad) {
    uint16_t base = (uint16_t)(0x0b00u + channel * 0x10u);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), start);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 10u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 12u), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 14u), 0u);
    dspic33_write_word(cpu, base, 0x8001u);
}

static void enable(Dspic33* cpu, uint8_t channel, uint16_t options, uint16_t baud) {
    uint16_t base = bases[channel];
    dspic33_write_word(cpu, (uint16_t)(base + 4u), baud);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(0x9000u | options));
}

static bool pop_slave_acknowledgement(Dspic33* cpu, uint8_t channel, bool acknowledge) {
    Dspic33I2cTransfer transfer;
    return dspic33_i2c_transmit(cpu, channel, &transfer) &&
           transfer.type == DSPIC33_I2C_ACKNOWLEDGE &&
           transfer.acknowledge == acknowledge && !transfer.master;
}

static void register_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        expect(state, dspic33_read_word(cpu, base) == 0u, "receive reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0u,
               "transmit reads zero");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0u,
               "baud reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x1000u,
               "control reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "status reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 10u)) == 0u,
               "address reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 12u)) == 0u,
               "mask reset");
        dspic33_write_word(cpu, base, 0xffffu);
        expect(state, dspic33_read_word(cpu, base) == 0u, "receive read only");
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0x01ffu,
               "baud mask");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0xbfe0u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0xbfe0u,
               "control mask");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "status clear-only mask");
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 10u)) == 0x03ffu,
               "address mask");
        dspic33_write_word(cpu, (uint16_t)(base + 12u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 12u)) == 0x03ffu,
               "slave mask mask");
    }
}

static void timing_cases(I2cConformance* state, Dspic33* cpu) {
    static const uint16_t baud_values[] = {2u, 3u, 17u, 0x01ffu};
    uint8_t channel;
    size_t index;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        for (index = 0u; index < sizeof(baud_values) / sizeof(baud_values[0]);
             index++) {
            uint16_t base = bases[channel];
            uint16_t baud = baud_values[index];
            uint64_t cycles = control_cycles(baud);
            Dspic33I2cTransfer transfer;
            dspic33_reset(cpu, 0u);
            enable(cpu, channel, 1u, baud);
            expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) != 0u,
                   "start active at write");
            expect(state, dspic33_device_advance(cpu, cycles - 1u),
                   "start boundary advance");
            expect(state, !interrupt_flag(cpu, master_irqs[channel]),
                   "start not complete early");
            expect(state, dspic33_device_advance(cpu, 1u), "start completion advance");
            expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u,
                   "start clears request");
            expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 8u) != 0u,
                   "start sets bus state");
            expect(state, interrupt_flag(cpu, master_irqs[channel]), "start interrupt");
            if (channel == 1u) {
                expect(state, !interrupt_flag(cpu, 51u),
                       "second module does not raise timer eight interrupt");
            }
            expect(state,
                   dspic33_i2c_transmit(cpu, channel, &transfer) &&
                       transfer.type == DSPIC33_I2C_START && transfer.master,
                   "start output");
        }
    }
}

