tylertms/dspic33e-sim/conformance/i2c.c
static void slave_transmit_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t channel_bit = (uint8_t)(1u << channel);
        Dspic33I2cTransfer transfer;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x31u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x31u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "slave read address");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x000eu) == 0x000eu,
               "slave read address status");
        expect(state, pop_slave_acknowledgement(cpu, channel, true),
               "slave read address acknowledgement");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "slave transmitter automatic stretch");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x7du);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 1u) != 0u,
               "slave transmit full");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, true, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave transmit acknowledged");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "slave transmit interrupt");
        expect(state,
               (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) != 0u,
               "slave acknowledge retains transmit state");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "slave acknowledge stretches next byte");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_WRITE && transfer.value == 0x7du &&
                   transfer.acknowledge && !transfer.master,
               "slave transmit output");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x82u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, false, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave transmit not acknowledged");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x8000u) != 0u,
               "slave nack status");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.value == 0x82u && !transfer.acknowledge,
               "slave nack output");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "slave nack interrupts");
        expect(state,
               (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u,
               "slave nack resets transmit state");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "slave nack does not stretch");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x31u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x31u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "slave stop read address");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x49u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, true, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave stop read data");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave stop read event");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x033cu) == 0x0034u,
               "slave stop preserves read and data status");
    }
}

static void slave_acknowledgement_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "matched address acknowledgement output");
        expect(state, !pop_slave_acknowledgement(cpu, channel, true),
               "matched address emits one acknowledgement");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x51u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, false),
               "mismatched address negative acknowledgement output");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0080u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "general call acknowledgement output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 12u), 0x007fu);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, false) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "disabled general call negative acknowledgement output");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0800u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "IPMI general call acknowledgement output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit high address acknowledgement output");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit low address acknowledgement output");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, true, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit repeated read acknowledgement output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit buffered high acknowledgement output");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   pop_slave_acknowledgement(cpu, channel, false) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0142u) == 0x0142u,
               "ten bit buffered low negative acknowledgement output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit reconfigured high acknowledgement output");
        dspic33_read_word(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit reconfigured low acknowledgement output");
        dspic33_read_word(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x01abu);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, true, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, false) &&
                   (cpu->io.i2c_slave_rejected & (uint8_t)(1u << channel)) != 0u,
               "ten bit reconfigured repeated read negative acknowledgement");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x01abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) && cpu->events.count == 0u &&
                   pop_slave_acknowledgement(cpu, channel, false),
               "ten bit high mismatch negative acknowledgement output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02acu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "ten bit low mismatch high acknowledgement output");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) && cpu->events.count == 0u &&
                   pop_slave_acknowledgement(cpu, channel, false),
               "ten bit low mismatch negative acknowledgement output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "first buffered address acknowledgement output");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, false) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0042u) == 0x0042u,
               "full receive buffer address negative acknowledgement");
        dspic33_read_word(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "cleared receive buffer address acknowledgement recovery");
        dspic33_read_word(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x31u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "received data acknowledgement output");
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x42u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, false),
               "full receive buffer data negative acknowledgement");
        expect(state, dspic33_read_word(cpu, base) == 0x0031u,
               "overflow retains prior received data");
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x53u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, false) &&
                   dspic33_read_word(cpu, base) == 0x0053u,
               "overflow status data negative acknowledgement");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x64u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true),
               "cleared overflow data acknowledgement recovery");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        cpu->io.i2c_tx[channel].count = DSPIC33_I2C_QUEUE_SIZE;
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   !dspic33_device_advance(cpu, 0u) &&
                   cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
                   cpu->io.i2c_tx[channel].count == DSPIC33_I2C_QUEUE_SIZE,
               "slave acknowledgement output queue failure");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        cpu->device_cycles = UINT64_MAX;
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   !dspic33_device_advance(cpu, 0u) &&
                   pop_slave_acknowledgement(cpu, channel, true) &&
                   cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
                   cpu->events.count == 0u,
               "ten bit second address scheduling failure");
    }
}

static void address_mode_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t channel_bit = (uint8_t)(1u << channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0440u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ten bit first address event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit first address interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) == 0u,
               "ten bit first address status");
        expect(state, dspic33_read_word(cpu, base) == 0x00f4u,
               "ten bit first address receive");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "ten bit first address stretches");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9440u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "ten bit second address clock released");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state, dspic33_device_advance(cpu, 1u), "ten bit second address event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit second address interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u,
               "ten bit second address status");
        expect(state, dspic33_read_word(cpu, base) == 0x00abu,
               "ten bit second address receive");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "ten bit second address stretches");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9440u);
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, true, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ten bit repeated read event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit repeated read interrupt");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x010cu) == 0x010cu,
               "ten bit repeated read status");
        expect(state, dspic33_read_word(cpu, base) == 0x00f5u,
               "ten bit repeated read receive");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x63u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, false, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "ten bit slave nack event");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x8000u) != 0u,
               "ten bit slave nack omits interrupt");
        expect(state,
               (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u,
               "ten bit slave nack resets transmit state");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ten bit address without receive stretch");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "ten bit first address always stretches");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit second address waits for release");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state, dspic33_device_advance(cpu, 1u),
               "ten bit second address after release");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00abu,
               "ten bit second address always stretches");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0080u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "general call event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "general call interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0200u) != 0u,
               "general call status");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x12u);
        enable(cpu, channel, 0x0c80u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x67u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi address event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00ceu,
               "ipmi accepts all addresses");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x0155u);
        enable(cpu, channel, 0x0080u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "non-ipmi ten bit preamble without address mode");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u,
               "non-ipmi address mode controls preamble matching");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x0155u);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "non-ipmi mismatched ten bit preamble");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u,
               "non-ipmi address controls preamble matching");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x0155u);
        enable(cpu, channel, 0x0c00u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi ten bit preamble with address mode");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   dspic33_read_word(cpu, base) == 0x00f4u,
               "ipmi bypasses enabled ten bit address matching");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9c00u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   dspic33_read_word(cpu, base) == 0x00abu,
               "ipmi bypasses enabled ten bit address low matching");

