tylertms/dspic33e-sim/conformance/i2c.c
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x0155u);
        enable(cpu, channel, 0x0880u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi ten bit preamble event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00f4u,
               "ipmi accepts ten bit preamble");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9880u);
        expect(state, dspic33_device_advance(cpu, 1u), "ipmi ten bit address event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00abu,
               "ipmi ten bit address stretches");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9880u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, true, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi ten bit read event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4107u) ==
                       0x0106u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00f5u,
               "ipmi ten bit read aborts without stretching");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x45u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "ipmi ten bit read aborts slave transfer");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x12u);
        enable(cpu, channel, 0x0c80u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x67u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi read address event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4007u) ==
                       0x0006u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00cfu,
               "ipmi read interrupts without stretching");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x44u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u &&
                   dspic33_read_word(cpu, base) == 0x00cfu,
               "ipmi read aborts slave transfer");
    }
}

static void address_rejection_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t channel_bit = (uint8_t)(1u << channel);

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) != 0u,
               "seven bit read control before mismatch");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x51u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "reject seven bit mismatch");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u,
               "seven bit mismatch enters rejected state");
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x44u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "ignore data after seven bit mismatch");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u,
               "ignore seven bit restart after mismatch");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u,
               "seven bit stop clears rejection");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u,
               "seven bit stop restores matching");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x01abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "reject ten bit high mismatch");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u,
               "ten bit high mismatch enters rejected state");
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x45u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "ignore data after ten bit high mismatch");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u,
               "ignore ten bit restart after high mismatch");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u,
               "ignore ten bit low bytes after high mismatch");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u,
               "ten bit high stop clears rejection");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u,
               "ten bit stop restores high matching");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u &&
                   dspic33_read_word(cpu, base) == 0x00abu &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u,
               "ten bit stop restores complete matching");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02acu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ten bit low mismatch first address");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u,
               "ten bit matching high byte remains active");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "reject ten bit low mismatch");
        expect(state,
               (cpu->io.i2c_slave_rejected & channel_bit) != 0u &&
                   (cpu->io.i2c_slave_active & channel_bit) == 0u &&
                   (cpu->io.i2c_slave_read & channel_bit) == 0u,
               "ten bit low mismatch enters rejected state");
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x46u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "ignore data after ten bit low mismatch");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u,
               "ignore ten bit restart after low mismatch");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u &&
                   (cpu->io.i2c_slave_rejected & channel_bit) != 0u,
               "ignore ten bit low byte after low mismatch");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u,
               "ten bit low stop clears rejection");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_active & channel_bit) != 0u,
               "ten bit stop restores low matching");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u &&
                   dspic33_read_word(cpu, base) == 0x00abu &&
                   (cpu->io.i2c_slave_rejected & channel_bit) == 0u,
               "ten bit low stop restores complete matching");
    }
}

static void isolation_and_power_cases(I2cConformance* state, Dspic33* cpu) {
    static const uint16_t pmd_addresses[DSPIC33_I2C_COUNT] = {0x0760u, 0x0764u};
    static const uint16_t pmd_masks[DSPIC33_I2C_COUNT] = {0x0080u, 0x0002u};
    Dspic33I2cTransfer transfer;
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 1u, 0u);
    enable(cpu, 1u, 1u, 9u);
    expect(state, dspic33_device_advance(cpu, control_cycles(0u)),
           "first channel independent completion");
    expect(state,
           interrupt_flag(cpu, master_irqs[0]) && !interrupt_flag(cpu, master_irqs[1]),
           "first channel independent interrupt");
    expect(state, dspic33_device_advance(cpu, control_cycles(9u) - control_cycles(0u)),
           "second channel independent completion");
    expect(state, interrupt_flag(cpu, master_irqs[1]),
           "second channel independent interrupt");
    expect(state,
           dspic33_i2c_transmit(cpu, 0u, &transfer) &&
               transfer.type == DSPIC33_I2C_START,
           "first channel independent output");
    expect(state,
           dspic33_i2c_transmit(cpu, 1u, &transfer) &&
               transfer.type == DSPIC33_I2C_START,
           "second channel independent output");

    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t control = (uint16_t)(bases[channel] + 6u);
        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0u, 0u);
        dspic33_write_word(cpu, control, 0x8000u);
        expect(state, dspic33_read_word(cpu, control) == 0x9000u,
               "software cannot clear release without stretch enable");
        dspic33_write_word(cpu, control, 0x8040u);
        expect(state, dspic33_read_word(cpu, control) == 0x8040u,
               "software clears release with stretch enable");
        dspic33_write_word(cpu, control, 0u);
        expect(state, dspic33_read_word(cpu, control) == 0x1000u,
               "module disable releases clock");
    }
    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 0u, 0u);
    dspic33_write_byte(cpu, 0x0203u, 0x5au);
    expect(state, (dspic33_read_word(cpu, 0x0208u) & 0x4001u) == 0u,
           "transmit high byte ignored");
    dspic33_write_byte(cpu, 0x0202u, 0x5au);
    expect(state, (dspic33_read_word(cpu, 0x0208u) & 0x4001u) == 0x4001u,
           "transmit low byte starts transfer");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0206u, 0xb001u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, dspic33_device_advance(cpu, control_cycles(0u)), "idle stop advance");
    expect(state,
           (dspic33_read_word(cpu, 0x0206u) & 1u) != 0u &&
               !interrupt_flag(cpu, master_irqs[0]),
           "idle stop freezes module");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state, dspic33_device_advance(cpu, 1u), "idle resume advance");
    expect(state,
           (dspic33_read_word(cpu, 0x0206u) & 1u) == 0u &&
               interrupt_flag(cpu, master_irqs[0]),
           "idle resume completes module");

    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint64_t total = control_cycles(9u);
        uint64_t elapsed = 4u;
        uint64_t remaining = total - elapsed;

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 1u, 9u);
        expect(state, dspic33_device_advance(cpu, elapsed),
               "power stop master partial advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) != 0u &&
                   !interrupt_flag(cpu, master_irqs[channel]),
               "power stop master remains pending");
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state, dspic33_device_advance(cpu, total + 5u),
               "power stop master disabled advance");
        expect(state,
               (stored_word(cpu, (uint16_t)(base + 6u)) & 1u) != 0u &&
                   !interrupt_flag(cpu, master_irqs[channel]),
               "power stop freezes master state");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state, dspic33_device_advance(cpu, remaining - 1u),
               "power stop master remaining advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) != 0u &&
                   !interrupt_flag(cpu, master_irqs[channel]),
               "power stop master waits exact remainder");
        expect(state, dspic33_device_advance(cpu, 1u),
               "power stop master completion advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u &&
                   interrupt_flag(cpu, master_irqs[channel]) &&
                   dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_START,
               "power stop master completes after remainder");

