tylertms/dspic33e-sim/conformance/i2c.c
        total = byte_cycles(3u);
        elapsed = 12u;
        remaining = total - elapsed;
        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0u, 3u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x5au);
        expect(state, dspic33_device_advance(cpu, elapsed),
               "power stop transmit partial advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4001u &&
                   !interrupt_flag(cpu, master_irqs[channel]),
               "power stop transmit remains active");
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state, dspic33_device_advance(cpu, total + 5u),
               "power stop transmit disabled advance");
        expect(state,
               (stored_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4001u &&
                   !interrupt_flag(cpu, master_irqs[channel]),
               "power stop freezes transmit state");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state, dspic33_device_advance(cpu, remaining - 1u),
               "power stop transmit remaining advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4000u &&
                   !interrupt_flag(cpu, master_irqs[channel]),
               "power stop transmit waits exact remainder");
        expect(state, dspic33_device_advance(cpu, 1u),
               "power stop transmit completion advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0u &&
                   interrupt_flag(cpu, master_irqs[channel]),
               "power stop transmit completes after remainder");
    }

    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t other = (uint8_t)(channel ^ 1u);
        uint16_t other_base = bases[other];
        uint64_t delay = (uint64_t)UINT32_MAX + 9u;
        uint64_t elapsed = delay - 7u;

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        dspic33_write_word(cpu, (uint16_t)(base + 12u), 1u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, delay) &&
                   dspic33_i2c_slave_stop(cpu, channel, delay + 1u) &&
                   dspic33_i2c_slave_start(cpu, channel, 0x53u, false, false,
                                           delay + 2u) &&
                   cpu->events.count == 3u,
               "power stop queues long slave sequence");
        expect(state, dspic33_device_advance(cpu, elapsed),
               "power stop slave partial advance");
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        dspic33_write_word(cpu, (uint16_t)(other_base + 10u), 0x31u);
        enable(cpu, other, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, other, 0x31u, false, false, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "power stop other channel event advance");
        expect(state,
               interrupt_flag(cpu, slave_irqs[other]) &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   dspic33_read_word(cpu, other_base) == 0x0062u &&
                   cpu->events.count == 3u,
               "power stop parked events do not block other channel");
        clear_interrupt(cpu, slave_irqs[other]);
        expect(state,
               dspic33_i2c_slave_stop(cpu, other, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "power stop other channel cleanup");
        expect(state, dspic33_device_advance(cpu, 19u),
               "power stop slave disabled advance");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (stored_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u &&
                   (cpu->io.i2c_slave_active & (uint8_t)(1u << channel)) == 0u &&
                   cpu->events.count == 0u,
               "power stop drops external slave sequence");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state, dspic33_device_advance(cpu, 6u),
               "power stop slave remaining advance");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "power stop slave waits exact remainder");
        expect(state, dspic33_device_advance(cpu, 1u),
               "power stop missed slave deadline advance");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) && cpu->events.count == 0u &&
                   (cpu->io.i2c_slave_active & (uint8_t)(1u << channel)) == 0u,
               "power stop does not replay missed slave events");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "power stop accepts new slave event after re-enable");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   dspic33_read_word(cpu, base) == 0x00a4u &&
                   (cpu->io.i2c_slave_active & (uint8_t)(1u << channel)) != 0u,
               "power stop receives new slave event after re-enable");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, delay) &&
                   cpu->events.count == 2u &&
                   (cpu->io.i2c_pmd_disabled & (uint8_t)(1u << channel)) == 0u,
               "power stop queues long event while disabled");
        expect(state, dspic33_device_advance(cpu, 25u),
               "power stop scheduled-disabled advance");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (stored_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u &&
                   cpu->events.count == 1u,
               "power stop holds event scheduled while disabled");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state, dspic33_device_advance(cpu, delay - 26u),
               "power stop scheduled-disabled remaining advance");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "power stop scheduled-disabled waits exact delay");
        expect(state, dspic33_device_advance(cpu, 1u),
               "power stop scheduled-disabled completion advance");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   dspic33_read_word(cpu, base) == 0x00a4u,
               "power stop scheduled-disabled event completes");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 1u) &&
                   cpu->events.count == 2u &&
                   (cpu->io.i2c_pmd_disabled & (uint8_t)(1u << channel)) == 0u,
               "power stop queues horizon event");
        expect(state, dspic33_device_advance(cpu, UINT64_MAX),
               "power stop horizon advance");
        expect(state,
               cpu->events.count == 0u && !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_slave_active & (uint8_t)(1u << channel)) == 0u,
               "power stop drops horizon external event");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
                   cpu->events.count == 0u &&
                   !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (cpu->io.i2c_pmd_disabled & (uint8_t)(1u << channel)) != 0u,
               "power stop reports unrepresentable re-enable");
    }

    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 1u, 0x01ffu);
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_device_advance(cpu, control_cycles(0x01ffu)),
           "reset canceled operation advance");
    expect(state, !interrupt_flag(cpu, master_irqs[0]),
           "reset cancels pending operation");
    expect(state, !dspic33_i2c_transmit(cpu, 0u, &transfer),
           "reset clears output queue");
}

static void pmd_transition_cases(I2cConformance* state, Dspic33* cpu) {
    static const uint16_t pmd_addresses[DSPIC33_I2C_COUNT] = {0x0760u, 0x0764u};
    static const uint16_t pmd_masks[DSPIC33_I2C_COUNT] = {0x0080u, 0x0002u};
    Dspic33 copy;
    uint8_t channel;
    bool initialized;

    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t baud = (uint16_t)(bases[channel] + 4u);
        uint8_t bit = (uint8_t)(1u << channel);

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               (cpu->io.i2c_pmd_disabled & bit) == 0u &&
                   cpu->io.i2c_pmd_generation[channel] == 1u,
               "PMD disable is delayed");
        dspic33_write_word(cpu, baud, 0x0055u);
        expect(state, dspic33_read_word(cpu, baud) == 0x0055u,
               "PMD disable permits current cycle access");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   (cpu->io.i2c_pmd_disabled & bit) != 0u,
               "PMD disable applies after one cycle");
        dspic33_write_word(cpu, baud, 0x00aau);
        expect(state, stored_word(cpu, baud) == 0x0055u,
               "PMD disabled module ignores writes");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               (cpu->io.i2c_pmd_disabled & bit) != 0u &&
                   cpu->io.i2c_pmd_generation[channel] == 2u,
               "PMD enable is delayed");
        dspic33_write_word(cpu, baud, 0x00bbu);
        expect(state, stored_word(cpu, baud) == 0x0055u,
               "PMD enable blocks access until transition");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   (cpu->io.i2c_pmd_disabled & bit) == 0u,
               "PMD enable applies after one cycle");
        dspic33_write_word(cpu, baud, 0x00ccu);
        expect(state, dspic33_read_word(cpu, baud) == 0x00ccu,
               "PMD enabled module accepts writes");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               cpu->io.i2c_pmd_generation[channel] == 2u && cpu->events.count == 2u,
               "rapid PMD toggle queues generations");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   (cpu->io.i2c_pmd_disabled & bit) == 0u &&
                   (dspic33_read_word(cpu, pmd_addresses[channel]) &
                    pmd_masks[channel]) == 0u,
               "stale PMD event cannot override latest state");

        dspic33_reset(cpu, 0u);
        cpu->device_cycles = UINT64_MAX;
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               (dspic33_read_word(cpu, pmd_addresses[channel]) & pmd_masks[channel]) ==
                       0u &&
                   cpu->io.i2c_pmd_generation[channel] == 2u &&
                   (cpu->io.i2c_pmd_disabled & bit) == 0u && cpu->events.count == 0u,
               "failed PMD transition rolls back and invalidates generation");
        expect(state, cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
               "failed PMD transition reports queue error");
    }

    dspic33_reset(cpu, 0u);
    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize pending PMD copy");
    if (!initialized) {
        return;
    }
    dspic33_write_word(cpu, pmd_addresses[0], pmd_masks[0]);
    expect(state, dspic33_copy(&copy, cpu), "copy pending PMD transition");
    expect(state,
           copy.io.i2c_pmd_generation[0] == 1u && copy.io.i2c_pmd_disabled == 0u &&
               copy.events.count == 1u && copy.events.items != cpu->events.items,
           "copy retains independent pending PMD state");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u) &&
               cpu->io.i2c_pmd_disabled == 1u && copy.io.i2c_pmd_disabled == 1u,
           "copied PMD transitions complete equally");
    dspic33_destroy(&copy);

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, pmd_addresses[0], pmd_masks[0]);
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.i2c_pmd_generation[0] == 0u && cpu->io.i2c_pmd_disabled == 0u &&
               cpu->events.count == 0u &&
               (dspic33_read_word(cpu, pmd_addresses[0]) & pmd_masks[0]) == 0u,
           "reset cancels pending PMD transition");
}

static void slave_power_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t vector = (uint16_t)(0x0240u + channel * 0x20u);

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        enable_interrupt(cpu, slave_irqs[channel], 3u, vector);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x51u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "sleep unmatched slave event advances");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) && !dspic33_device_wake(cpu) &&
                   cpu->power_state == DSPIC33_POWER_SLEEP,
               "sleep unmatched slave event cannot wake");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        enable_interrupt(cpu, slave_irqs[channel], 3u, vector);
        cpu->w[15] = 0x1800u;
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "sleep matched slave event advances");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) != 0u &&
                   dspic33_read_word(cpu, base) == 0x00a4u,
               "sleep matched slave event receives address");
        expect(state,
               dspic33_device_advance(cpu, 1u) && dspic33_device_wake(cpu) &&
                   cpu->last_interrupt == slave_irqs[channel] && cpu->pc == vector &&
                   cpu->w[15] == 0x1804u,
               "sleep matched slave event wakes through vector");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "idle-running slave event advances");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) != 0u &&
                   dspic33_read_word(cpu, base) == 0x00a4u,
               "I2CSIDL clear continues slave operation in Idle");
    }
}

static void disable_cases(I2cConformance* state, Dspic33* cpu) {
    static const uint16_t requests[] = {1u, 2u, 4u, 8u, 16u};
    uint8_t channel;
    size_t index;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        for (index = 0u; index < sizeof(requests) / sizeof(requests[0]); index++) {
            dspic33_reset(cpu, 0u);
            enable(cpu, channel, requests[index], 2u);
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & requests[index]) !=
                       0u,
                   "disable request active");
            dspic33_write_word(cpu, (uint16_t)(base + 6u), 0u);
            expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x1000u,
                   "disable clears request and releases clock");
            expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
                   "disable clears status");
            expect(state, dspic33_device_advance(cpu, receive_cycles(2u)),
                   "disabled request canceled advance");
            expect(state, !interrupt_flag(cpu, master_irqs[channel]),
                   "disabled request canceled interrupt");
            enable(cpu, channel, 1u, 2u);
            expect(state, dspic33_device_advance(cpu, control_cycles(2u)),
                   "disable clean re-enable advance");
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u &&
                       interrupt_flag(cpu, master_irqs[channel]),
                   "disable clean re-enable completion");
        }

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0u, 2u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x5au);
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4001u,
               "disable transmit active");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x1000u,
               "disable transmit releases clock");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "disable transmit clears status");
        expect(state, dspic33_device_advance(cpu, byte_cycles(2u)),
               "disabled transmit canceled advance");
        expect(state, !interrupt_flag(cpu, master_irqs[channel]),
               "disabled transmit canceled interrupt");
        enable(cpu, channel, 1u, 2u);
        expect(state, dspic33_device_advance(cpu, control_cycles(2u)),
               "disable transmit clean re-enable advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u &&
                   interrupt_flag(cpu, master_irqs[channel]),
               "disable transmit clean re-enable completion");
    }
}

