tylertms/dspic33e-sim/conformance/i2c.c
static void dma_isolation_cases(I2cConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3000u, 0xa55au);
    configure_dma_channel(cpu, 0u, slave_irqs[1], 0x3000u, bases[1]);
    dspic33_write_word(cpu, (uint16_t)(bases[1] + 10u), 0x52u);
    enable(cpu, 1u, 0u, 2u);
    expect(state,
           dspic33_i2c_slave_start(cpu, 1u, 0x52u, false, false, 0u) &&
               dspic33_device_advance(cpu, 0u),
           "slave event advance without dma");
    expect(state, dspic33_read_word(cpu, 0x3000u) == 0xa55au,
           "slave event does not request dma");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3000u, 0x5aa5u);
    configure_dma_channel(cpu, 0u, master_irqs[1], 0x3000u, bases[1]);
    enable(cpu, 1u, 1u, 2u);
    expect(state, dspic33_device_advance(cpu, control_cycles(2u)),
           "master event advance without dma");
    expect(state, dspic33_read_word(cpu, 0x3000u) == 0x5aa5u,
           "master event does not request dma");
}

int main(void) {
    Dspic33 cpu;
    I2cConformance state = {0u, 0u, 0u};
    if (!dspic33_initialize(&cpu)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    register_cases(&state, &cpu);
    timing_cases(&state, &cpu);
    bus_status_timing_cases(&state, &cpu);
    master_sequence_cases(&state, &cpu);
    master_error_cases(&state, &cpu);
    slave_receive_cases(&state, &cpu);
    slave_transmit_cases(&state, &cpu);
    address_mode_cases(&state, &cpu);
    address_rejection_cases(&state, &cpu);
    slave_acknowledgement_cases(&state, &cpu);
    disable_cases(&state, &cpu);
    isolation_and_power_cases(&state, &cpu);
    pmd_transition_cases(&state, &cpu);
    slave_power_cases(&state, &cpu);
    dma_isolation_cases(&state, &cpu);
    expect(&state, state.cases == 776u, "I2C assertion arithmetic");
    dspic33_destroy(&cpu);
    printf("[i2c-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
